Revit 2027 API
RadioButtonGroup.AddItem Method
Adds a new ToggleButton to the RadioButtonGroup.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ToggleButton AddItem(
	ToggleButtonData buttonData
)
Public Function AddItem (
	buttonData As ToggleButtonData
) As ToggleButton
public:
ToggleButton^ AddItem(
	ToggleButtonData^ buttonData
)
member AddItem :
        buttonData : ToggleButtonData -> ToggleButton
Parameters
buttonData ToggleButtonData
An object containing the data needed to construct the ToggleButton.
Return Value
ToggleButton
 The newly added ToggleButton.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when buttonData is null.
ArgumentException |  Thrown when button with buttonData.Name already exists in the group.
See Also
Reference
RadioButtonGroup Class
Autodesk.Revit.UI Namespace